In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder

In [3]:
data=pd.read_csv(r'pandas/employee_records.csv')
data.head()

,Employee ID,Employee Name,Address,Post,Monthly Salary,Age,Marital Status,Gender
0,f086e110-447e-47bb-8216-f43333b83c99,Anna Alvarado,"1812 Christopher Ways Apt. 060\r\nPort Cody, P...","Geologist, wellsite",9009.93,43,Married,Male
1,d6f4d4f0-ed64-412b-8839-6d58f1e2d677,Peter Williams,"265 David Light\r\nAngelaport, AZ 34012",Aeronautical engineer,7048.79,38,Married,Male
2,10855e43-7e2e-4336-b399-5bcb75d9ebb2,Crystal Mcguire,"07950 Scott Course Apt. 268\r\nWest Stephanie,...",Quarry manager,10988.46,46,Single,Female
3,1356a938-2c8c-419b-9c3f-28d2a742b668,Daniel Miller,"6660 Karen Hills Suite 025\r\nNicholasshire, G...",Clinical research associate,5555.19,38,Married,Female
4,afc415b8-e9e6-4f3a-9645-c8f7906c8022,James Kim,"5544 Morrison Villages\r\nEast Staceyborough, ...",Ceramics designer,7360.91,44,Single,Female

In [4]:
group=data.groupby('Gender')['Marital Status'].size()
group

Gender
Female    494
Male      506
Name: Marital Status, dtype: int64

In [6]:
def age_cat(x):
    if x<30:
        return '25-29'
    elif x<35:
        return '30-34'
    elif x<40:
        return '35-39'
    else:
        return '40 and above'

In [10]:
data['age group']=data['Age'].apply(age_cat)

In [14]:
age_group = data.groupby(['age group','Gender'])['Age'].mean()
age_group

age group     Gender
25-29         Female    27.171717
              Male      27.023256
30-34         Female    31.852941
              Male      31.926316
35-39         Female    36.921348
              Male      36.814433
40 and above  Female    44.823529
              Male      45.250000
Name: Age, dtype: float64

In [16]:
#importing cars data
data = pd.read_csv(r'pandas/used_cars_data.csv')
data.head()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [18]:
data['Price'].isna().sum()

1234

In [22]:
x = data['Price'].mean()

In [23]:
data['Price']=data['Price'].fillna(x)

In [24]:
data['Price'].isna().sum()

0

In [25]:
#dropna()
#syntax
#drop duplicates
#duplicated()

In [28]:
data['Price'].dtype

dtype('float64')

In [30]:
data['Price']=data['Price'].astype(int)

In [31]:
data.columns

Index(['S.No.', 'Name', 'Location', 'Year', 'Kilometers_Driven', 'Fuel_Type',
       'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats',
       'New_Price', 'Price'],
      dtype='object')

In [33]:
cars_no = data.groupby('Fuel_Type')['Name'].size().sort_index()
cars_no

Fuel_Type
CNG           62
Diesel      3852
Electric       2
LPG           12
Petrol      3325
Name: Name, dtype: int64

In [35]:
#Sales of car according to location
car_sales = data.groupby('Location')['Name'].size().sort_index()
car_sales

Location
Ahmedabad     275
Bangalore     440
Chennai       591
Coimbatore    772
Delhi         660
Hyderabad     876
Jaipur        499
Kochi         772
Kolkata       654
Mumbai        949
Pune          765
Name: Name, dtype: int64

In [36]:
#Sales of car according to location
car_sales = data.groupby(['Location','Fuel_Type'])['Name'].size().sort_index()
car_sales

Location    Fuel_Type
Ahmedabad   CNG            3
            Diesel       169
            Petrol       103
Bangalore   CNG            1
            Diesel       273
            Petrol       166
Chennai     CNG            2
            Diesel       341
            Electric       1
            Petrol       247
Coimbatore  Diesel       430
            Petrol       342
Delhi       CNG           12
            Diesel       361
            Petrol       287
Hyderabad   CNG            3
            Diesel       593
            LPG            6
            Petrol       274
Jaipur      Diesel       276
            LPG            4
            Petrol       219
Kochi       CNG            9
            Diesel       358
            Petrol       405
Kolkata     CNG            1
            Diesel       316
            Petrol       337
Mumbai      CNG           18
            Diesel       371
            Electric       1
            LPG            1
            Petrol       558
Pune        CNG           13
            Diesel       364
            LPG            1
            Petrol       387
Name: Name, dtype: int64

In [37]:
data['Engine']

0        998 CC
1       1582 CC
2       1199 CC
3       1248 CC
4       1968 CC
         ...
7248    1598 CC
7249    1197 CC
7250    1461 CC
7251    1197 CC
7252    2148 CC
Name: Engine, Length: 7253, dtype: object

In [38]:
data['Engine']=data['Engine'].str.replace('CC','')
data['Engine']

0        998
1       1582
2       1199
3       1248
4       1968
        ...
7248    1598
7249    1197
7250    1461
7251    1197
7252    2148
Name: Engine, Length: 7253, dtype: object

In [49]:
data['Engine']=data['Engine'].astype('f')
data['Engine']

0        998.0
1       1582.0
2       1199.0
3       1248.0
4       1968.0
         ...
7248    1598.0
7249    1197.0
7250    1461.0
7251    1197.0
7252    2148.0
Name: Engine, Length: 7253, dtype: float32

In [50]:
data['Engine']= data['Engine'].fillna(data['Engine'].mean())

In [51]:
data['Engine'].isna().sum()

0

In [56]:
avgP = data.groupby('Location')['Price'].mean().sort_index()
avgP

Location
Ahmedabad      8.167273
Bangalore     12.161364
Chennai        7.590525
Coimbatore    13.579016
Delhi          9.201515
Hyderabad      9.269406
Jaipur         5.981964
Kochi         10.414508
Kolkata        5.859327
Mumbai         8.933614
Pune           6.823529
Name: Price, dtype: float64

In [73]:
data['Mileage'].isna().sum()

0

In [74]:
data['Mileage'] = data['Mileage'].str.replace('kmpl',' ')
data['Mileage'].head()

0     26.6
1    19.67
2     18.2
3    20.77
4     15.2
Name: Mileage, dtype: object

In [77]:
data['Mileage'] = data['Mileage'].fillna('').str.replace('kmpl',' ').fillna(0).astype('float')
data['Mileage'].astype('f')

0       26.600000
1       19.670000
2       18.200001
3       20.770000
4       15.200000
          ...
7248    20.540001
7249    17.209999
7250    23.080000
7251    17.200001
7252    10.000000
Name: Mileage, Length: 7253, dtype: float32

In [78]:
data.groupby('Seats')['Mileage'].mean()

Seats
0.0     10.500000
2.0     11.630000
4.0     18.644454
5.0     18.818350
6.0     15.105789
7.0     14.706344
8.0     13.183765
9.0     13.526667
10.0    11.896250
Name: Mileage, dtype: float64

In [88]:
data['cyear']=2024
data['Year'] = data['Year'].astype('f')
data['age'] = data['cyear'] - data['Year']
data.groupby('age')['Name'].size()

age
5.0     119
6.0     361
7.0     709
8.0     886
9.0     929
10.0    925
11.0    791
12.0    690
13.0    579
14.0    407
15.0    252
16.0    207
17.0    148
18.0     89
19.0     68
20.0     35
21.0     20
22.0     18
23.0      8
24.0      5
25.0      2
26.0      4
28.0      1
Name: Name, dtype: int64

In [85]:
#cars type sales according to year
sales = data.groupby(['Year','Transmission'])['Name'].size()
sales

Year    Transmission
1996.0  Manual            1
1998.0  Automatic         1
        Manual            3
1999.0  Manual            2
2000.0  Manual            5
2001.0  Manual            8
2002.0  Manual           18
2003.0  Automatic         3
        Manual           17
2004.0  Automatic         6
        Manual           29
2005.0  Automatic        12
        Manual           56
2006.0  Automatic        11
        Manual           78
2007.0  Automatic        22
        Manual          126
2008.0  Automatic        47
        Manual          160
2009.0  Automatic        81
        Manual          171
2010.0  Automatic        88
        Manual          319
2011.0  Automatic       160
        Manual          419
2012.0  Automatic       174
        Manual          516
2013.0  Automatic       218
        Manual          573
2014.0  Automatic       265
        Manual          660
2015.0  Automatic       274
        Manual          655
2016.0  Automatic       269
        Manual          617
2017.0  Automatic       232
        Manual          477
2018.0  Automatic       132
        Manual          229
2019.0  Automatic        54
        Manual           65
Name: Name, dtype: int64

In [86]:
#size(), sum(), value_count()
#index(), values()